Reports/Трофеи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Трофеи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КомандаИлиИгрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чемпионат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОчков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗабито</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПропущено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/Итоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Итоги</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗабито</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПропущено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Трофеи/Ext/ObjectModule.bsl
Функция ОтчетСформировать(Отчет) Экспорт
	Отчет.Данные.Очистить();
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	
	Итератор	= 0;
	Список		= ДанныеПолучить(Отчет);
	Для Каждого Выборка Из Список Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Графика|Матч");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		Если Выборка.ЕстьКартинка Тогда
			СерверныйФункции.КартинкаУстановить(ОбластьМакета, Выборка.Ссылка);
		КонецЕсли;
		Если Итератор = 0 Тогда
			ТабДокумент.Вывести(ОбластьМакета);
		Иначе
			ТабДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		Итератор	= Итератор + 1;
		Если Итератор < 6 Тогда
			ТабДокумент.Присоединить(Макет.ПолучитьОбласть("Графика|Пусто"));
		Иначе
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));
			Итератор = 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ДанныеПолучить(Отчет)
	Ответ	= Новый Массив;
	
	Отчет.Данные.Очистить();
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Чемпионаты.Ссылка КАК Чемпионат,
	      	               |	Чемпионаты.Владелец КАК Ссылка,
	      	               |	Чемпионаты.Владелец.Код КАК Код,
	      	               |	Чемпионаты.Владелец.Наименование КАК Наименование,
	      	               |	Чемпионаты.Владелец.ОлимпийскаяСистема КАК ОлимпийскаяСистема,
	      	               |	1 КАК Количество,
	      	               |	РАЗМЕРХРАНИМЫХДАННЫХ(Чемпионаты.Владелец.Изображение) >= 64 КАК ЕстьКартинка,
	      	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Чемпионаты.Владелец) КАК Представление,
	      	               |	Чемпионаты.ДатаОкончания КАК Период,
	      	               |	Итоги.КоличествоОчков КАК КоличествоОчков,
	      	               |	Итоги.КоличествоЗабито КАК КоличествоЗабито,
	      	               |	Итоги.КоличествоПропущено КАК КоличествоПропущено
	      	               |ИЗ
	      	               |	РегистрСведений.Итоги КАК Итоги
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	      	               |		ПО Итоги.Чемпионат = Чемпионаты.Ссылка
	      	               |ГДЕ
	      	               |	Итоги.Команда = &Ссылка
	      	               |	И Итоги.Место = 1
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ЕстьКартинка УБЫВ,
	      	               |	ГОД(Чемпионаты.ДатаОкончания) УБЫВ
	      	               |ИТОГИ
	      	               |	МАКСИМУМ(Код),
	      	               |	МАКСИМУМ(Наименование),
	      	               |	МАКСИМУМ(ОлимпийскаяСистема),
	      	               |	СУММА(Количество),
	      	               |	МАКСИМУМ(ЕстьКартинка),
	      	               |	МАКСИМУМ(Представление),
	      	               |	МАКСИМУМ(Период)
	      	               |ПО
	      	               |	Ссылка");
	Если ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Игроки") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Чемпионаты.Ссылка КАК Чемпионат,
		               |	Чемпионаты.Владелец КАК Ссылка,
		               |	Чемпионаты.Владелец.Код КАК Код,
		               |	Чемпионаты.Владелец.Наименование КАК Наименование,
		               |	Чемпионаты.Владелец.ОлимпийскаяСистема КАК ОлимпийскаяСистема,
		               |	Итоги.Команда КАК Команда,
		               |	1 КАК Количество,
		               |	РАЗМЕРХРАНИМЫХДАННЫХ(Чемпионаты.Владелец.Изображение) >= 64 КАК ЕстьКартинка,
		               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Чемпионаты.Владелец) КАК Представление,
		               |	Чемпионаты.ДатаОкончания КАК Период,
		               |	Итоги.КоличествоОчков КАК КоличествоОчков,
		               |	Итоги.КоличествоЗабито КАК КоличествоЗабито,
		               |	Итоги.КоличествоПропущено КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрСведений.Итоги КАК Итоги
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		               |		ПО Итоги.Чемпионат = Чемпионаты.Ссылка
		               |ГДЕ
		               |	(Итоги.Чемпионат, Итоги.Команда) В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				МатчСоставыКоманд.Ссылка.Тур.Владелец,
		               |				МатчСоставыКоманд.Команда
		               |			ИЗ
		               |				Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |			ГДЕ
		               |				МатчСоставыКоманд.Игрок = &Ссылка)
		               |	И Итоги.Место = 1
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЕстьКартинка УБЫВ,
		               |	ГОД(Чемпионаты.ДатаОкончания) УБЫВ
		               |ИТОГИ
		               |	МАКСИМУМ(Код),
		               |	МАКСИМУМ(Наименование),
		               |	МАКСИМУМ(ОлимпийскаяСистема),
		               |	СУММА(Количество),
		               |	МАКСИМУМ(ЕстьКартинка),
		               |	МАКСИМУМ(Представление),
		               |	МАКСИМУМ(Период)
		               |ПО
		               |	Ссылка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",				Отчет.КомандаИлиИгрок);
	Выборка	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 0 Тогда
			Элемент = Новый Структура("Ссылка,Код,Наименование,Количество,ЕстьКартинка,Представление");
			ЗаполнитьЗначенияСвойств(Элемент, Выборка);
			Если Выборка.ЕстьКартинка Тогда
				Элемент.Представление	= СерверныйФункции.ИзображениеПолучить(Выборка.Ссылка);
			КонецЕсли;
			Ответ.Добавить(Элемент);
		КонецЕсли;
		Выбор = Выборка.Выбрать();
		Пока Выбор.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выбор);
		КонецЦикла;
	КонецЦикла;
	Возврат Ответ;
КонецФункции
